Tekla Open API Reference for Tekla Structures 2025
GridPlane.ExtensionForMagneticArea Property
Note: This API is now obsolete.
 The extension for the magnetic area.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Property not supported anymore.")]
public double ExtensionForMagneticArea { get; set; }
<ObsoleteAttribute("Property not supported anymore.")>
Public Property ExtensionForMagneticArea As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GridPlane Class
Tekla.Structures.Model Namespace